# Работа с табличными данными (pandas) и способами визуализации с помощью библиотек (matplotlib и seadorn).
# Чтобы приступить непосредственно к машинному обучению, важно произвести EDA (Exploratory Data Analysis) -
# разведочный анализ данных.

# Он состоит в анализе основных свойств данных, нахождения в них общих закономерностей, распределений и анамалий,
# построение начальных модулей, зачастую с использованием инструментов визуализации.
# цель анализа

# 1. Максимальное "Проникновение" в данные:
# 2. Выявление основных структур
# 3. Выбор наиболее важных переменных
# 4. Однаружение отклонений и аномалий
# 5. Проверка основных гипотез
