# Пустой список
x = []
print(x)  # []
y = list()
print(y)  # []
z = [1, 2, 3, 4, 5]
print(z)  # [1, 2, 3, 4, 5]
print(*z)  # 1 2 3 4 5

# for i in z:
#     print(i)

print(len(z))  # в списке пять элементов 5
print(z[2])  # 3
print(z[-4])  # 2

# функция добавление в список (append)

s = [1, 5, 9]
print(s)  # [1, 5, 9]
s.append(90)
print(s)  # [1, 5, 9, 90]

# Добавление данных в пустой список

d = []
for i in range(10):
    d.append(i + 1)
print(d)  # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]

print(d.pop(-4))  # удаляет 7 и выводит
print(d)  # [1, 2, 3, 4, 5, 6, 8, 9, 10]
print(d.pop())  # Удаляет последнее число

# Добавление элемента на нужную позицию

r = [1, 2, 3, 4, 5, 6, 7, 8, 9, 10]
print(r.insert(2, 444))  # None
print(r)  # [1, 2, 444, 3, 4, 5, 6, 7, 8, 9, 10]
print(r.sort())  # None
print(r)  # [1, 2, 3, 4, 5, 6, 7, 8, 9, 10, 444]

# срезы списка

