# Операции со множествами в Python

a = {1, 22, 3, 55, 8}
b = {22, 55, 88, 13, 21}
c = a.copy() # c = {1, 3, 22, 55, 8} копирование
print(c) # {1, 3, 22, 55, 8}
u =a.union(b) #  {1, 3, 8, 13, 21, 22, 55, 88} объединение
print(u) # {1, 3, 8, 13, 21, 22, 55, 88}
i = a.intersection(b) # {22, 55} пересечение
print(i) # {22, 55}
dl = a.difference(b) # {8, 1, 3} разность из множества a - b
print(dl) # {8, 1, 3}
dr = b.difference(a)# {88, 21, 13} разность из множества b - a
print(dr) # {88, 21, 13}
q = a.union(b).difference(a.intersection(b))
#      2 дейс   3 дейст         1 дейст
#  2 действие({1, 3, 8, 13, 21, 22, 55, 88}) 3 действие  разница - 1 действие ({22, 55}) ## {1, 3, 8, 13, 21, 88}
print(q)

