# Генератор списка (List comprehension). List comprehension - это упрощеный подход к созданию списка,
# который задействует цикл for, а также инструкции if-else для определения того, что в итоге окажется в финальном
# списке.

# 1. Простая ситуация - список

a = [(1234) for i in range(6)]  # [1234, 1234, 1234, 1234, 1234, 1234]
print(a)

b = [i for i in range(-100, 101, 10)]
print(b) # [-100, -90, -80, -70, -60, -50, -40, -30, -20, -10, 0, 10, 20, 30, 40, 50, 60, 70, 80, 90, 100]

# 2. Выборка по какому-то условию.
# x = [exp for item in iterable(if conditional)]

x = [i for i in range(0, 11, 2)]
print(f'x =', x) # x = [0, 2, 4, 6, 8, 10]
z = [i for i in range(0, 11) if i % 2 == 0]
print(f'z =', z) # z = [0, 2, 4, 6, 8, 10]
v = [{i, i ** 2, i**3} for i in range(1, 11) if i % 2 == 0]
print(f'v =', v) # v = [(2, 4, 8), (4, 16, 64), (6, 36, 216), (8, 64, 512), (10, 100, 1000)]

